micropython/micropython/ports/psoc-edge/machine_ipc.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */


// std includes
#include <stdio.h>
#include "py/runtime.h"
#include "py/mphal.h"
#include "cybsp.h"
#include "cy_pdl.h"
#include "cy_ipc_pipe.h"

// port-specific includes
#include "machine_ipc.h"

/*******************************************************************************
* Macros
*******************************************************************************/
#define IPC_MAX_CLIENTS_PER_EP      (8UL)
#define IPC_MAX_ENDPOINTS           (5UL)
#define CM55_APP_BOOT_ADDR          (CYMEM_CM33_0_m55_nvm_START + CYBSP_MCUBOOT_HEADER_SIZE)
#define CM55_BOOT_WAIT_TIME_USEC    (10U)
#define CM55_APP_DELAY_MS           (50U)

#define CM33_APP_DELAY_MS           (50U)

/* Core ID constants */
#define CM33               (0U)
#define CM55               (1U)

/*******************************************************************************
* Global Variables
*******************************************************************************/
static bool cm55_enabled = false;
CY_SECTION_SHAREDMEM static ipc_msg_t ipc_msg_buffer;
machine_ipc_obj_t *machine_ipc_obj[IPC_MAX_CLIENTS_PER_EP] = {NULL};

/*******************************************************************************
* machine_ipc_client_obj_t IRQ methods and type
*******************************************************************************/

static mp_uint_t machine_ipc_client_irq_trigger(mp_obj_t self_in, mp_uint_t new_trigger) {
    if (new_trigger == 0) {
        machine_ipc_client_obj_t *client = MP_OBJ_TO_PTR(self_in);
        client->base.handler = mp_const_none;
        if (client->client_id < IPC_MAX_CLIENTS_PER_EP) {
            MP_STATE_PORT(machine_ipc_client_handlers)[client->client_id] = mp_const_none;
        }
    }
    return 0;
}

static mp_uint_t machine_ipc_client_irq_info(mp_obj_t self_in, mp_uint_t info_type) {
    (void)self_in;
    (void)info_type;
    return 0;
}

static const mp_irq_methods_t machine_ipc_client_irq_methods = {
    .trigger = machine_ipc_client_irq_trigger,
    .info = machine_ipc_client_irq_info,
};

static void machine_ipc_client_attr(mp_obj_t self_in, qstr attr, mp_obj_t *dest) {
    if (dest[0] != MP_OBJ_NULL) {
        return;
    }
    machine_ipc_client_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (attr == MP_QSTR_cmd) {
        dest[0] = MP_OBJ_NEW_SMALL_INT(self->last_cmd);
    } else if (attr == MP_QSTR_value) {
        dest[0] = mp_obj_new_int_from_uint(self->last_value);
    } else if (attr == MP_QSTR_id) {
        dest[0] = MP_OBJ_NEW_SMALL_INT(self->client_id);
    }
}

MP_DEFINE_CONST_OBJ_TYPE(
    machine_ipc_client_type,
    MP_QSTR_IPCClient,
    MP_TYPE_FLAG_NONE,
    attr, machine_ipc_client_attr);

/*******************************************************************************
* IPC Helper functions
*******************************************************************************/

/**
 * Get endpoint configuration based on core ID
 * Returns endpoint address, channel, interrupt, and other config params
 */
static void get_endpoint_config_for_core(uint8_t core_id,
    uint32_t *ep_addr,
    uint32_t *ep_channel,
    uint32_t *ep_intr,
    uint32_t *ep_intr_mux,
    uint32_t *ep_intr_priority) {
    switch (core_id) {
        case CM33:
            *ep_addr = CM33_IPC_PIPE_EP_ADDR;
            *ep_channel = CY_IPC_CHAN_CYPIPE_EP1;
            *ep_intr = CY_IPC_INTR_CYPIPE_EP1;
            *ep_intr_mux = CY_IPC_INTR_CYPIPE_MUX_EP1;
            *ep_intr_priority = CY_IPC_INTR_CYPIPE_PRIOR_EP1;
            break;

        case CM55:
            *ep_addr = CM55_IPC_PIPE_EP_ADDR;
            *ep_channel = CY_IPC_CHAN_CYPIPE_EP2;
            *ep_intr = CY_IPC_INTR_CYPIPE_EP2;
            *ep_intr_mux = CY_IPC_INTR_CYPIPE_MUX_EP2;
            *ep_intr_priority = CY_IPC_INTR_CYPIPE_PRIOR_EP2;
            break;

        default:
            // Invalid core - set to zero
            *ep_addr = 0;
            *ep_channel = 0;
            *ep_intr = 0;
            *ep_intr_mux = 0;
            *ep_intr_priority = 0;
            break;
    }
}

/**
 * Get endpoint address for a given core ID
 */
static uint32_t get_ep_addr_for_core(uint8_t core_id) {
    switch (core_id) {
        case CM33:
            return CM33_IPC_PIPE_EP_ADDR;
        case CM55:
            return CM55_IPC_PIPE_EP_ADDR;
        default:
            return 0;
    }
}

/**
 * Get channel for a given core ID
 */
static uint32_t get_channel_for_core(uint8_t core_id) {
    switch (core_id) {
        case CM33:
            return CY_IPC_CHAN_CYPIPE_EP1;
        case CM55:
            return CY_IPC_CHAN_CYPIPE_EP2;
        default:
            return 0;
    }
}

/**
 * Build IPC pipe configuration structure
 */
static bool build_ipc_pipe_config(cy_stc_ipc_pipe_config_t *config_out,
    uint8_t src_core,
    uint8_t target_core,
    cy_ipc_pipe_callback_ptr_t *callbacks_array,
    void (*isr_handler)(void)) {

    // Validate cores
    if (src_core >= CM55 + 1 || target_core >= CM55 + 1) {
        printf("Error: Invalid core IDs (src=%d, target=%d)\r\n", src_core, target_core);
        return false;
    }

    if (src_core == target_core) {
        printf("Error: Source and target cores cannot be the same\r\n");
        return false;
    }

    // Get source endpoint configuration
    uint32_t src_addr, src_channel, src_intr, src_intr_mux, src_intr_priority;
    get_endpoint_config_for_core(src_core, &src_addr, &src_channel, &src_intr,
        &src_intr_mux, &src_intr_priority);

    // Get target endpoint configuration
    uint32_t tgt_addr, tgt_channel, tgt_intr, tgt_intr_mux, tgt_intr_priority;
    get_endpoint_config_for_core(target_core, &tgt_addr, &tgt_channel, &tgt_intr,
        &tgt_intr_mux, &tgt_intr_priority);

    // Build configuration structure to match static config roles
    // Endpoint 0: Source core (CM33 - receiver for messages from CM55)
    config_out->ep0ConfigData.ipcNotifierNumber = src_intr;
    config_out->ep0ConfigData.ipcNotifierPriority = src_intr_priority;
    config_out->ep0ConfigData.ipcNotifierMuxNumber = src_intr_mux;
    config_out->ep0ConfigData.epAddress = src_addr;
    config_out->ep0ConfigData.epConfig.epChannel = src_channel;
    config_out->ep0ConfigData.epConfig.epIntr = src_intr;
    config_out->ep0ConfigData.epConfig.epIntrmask = CY_IPC_CYPIPE_INTR_MASK;

