micropython/micropython/ports/psoc-edge/machine_ipc.c
    // Endpoint 1: Target core (CM55 - sender of messages to CM33)
    config_out->ep1ConfigData.ipcNotifierNumber = tgt_intr;
    config_out->ep1ConfigData.ipcNotifierPriority = tgt_intr_priority;
    config_out->ep1ConfigData.ipcNotifierMuxNumber = tgt_intr_mux;
    config_out->ep1ConfigData.epAddress = tgt_addr;
    config_out->ep1ConfigData.epConfig.epChannel = tgt_channel;
    config_out->ep1ConfigData.epConfig.epIntr = tgt_intr;
    config_out->ep1ConfigData.epConfig.epIntrmask = CY_IPC_CYPIPE_INTR_MASK;

    // Common configuration
    config_out->endpointClientsCount = IPC_MAX_CLIENTS_PER_EP;
    config_out->endpointsCallbacksArray = callbacks_array;
    config_out->userPipeIsrHandler = isr_handler;

    return true;
}

/**
 * Send an IPC message to target core
 *
 * @param src_endpoint_addr Source endpoint address (e.g., CM33_IPC_PIPE_EP_ADDR)
 * @param target_endpoint_addr Target endpoint address (e.g., CM55_IPC_PIPE_EP_ADDR)
 * @param target_client_id Target client ID (0-7)
 * @param cmd Command byte
 * @param value Data value
 * @return true if send successful, false otherwise
 */
static bool ipc_send_message(uint32_t src_endpoint_addr,
    uint32_t target_endpoint_addr,
    uint8_t target_client_id,
    uint8_t cmd,
    uint32_t value) {
    // Validate client_id
    if (target_client_id >= IPC_MAX_CLIENTS_PER_EP) {
        mp_printf(&mp_plat_print, "[CM33] Error: Invalid target_client_id %d\r\n", target_client_id);
        return false;
    }

    // Prepare message in shared memory buffer
    ipc_msg_buffer.client_id = target_client_id;
    ipc_msg_buffer.intr_mask = CY_IPC_CYPIPE_INTR_MASK;
    ipc_msg_buffer.cmd = cmd;
    ipc_msg_buffer.value = value;

    // Wait for channel to be free, then send
    cy_en_ipc_pipe_status_t status;
    uint32_t retry_count = 0;
    const uint32_t MAX_RETRIES = 100000;  // Allow retry to avoid intermittent failure

    do {
        status = Cy_IPC_Pipe_SendMessage(
            target_endpoint_addr,    // toAddr   = destination (CM55)
            src_endpoint_addr,       // fromAddr = source      (CM33)
            (void *)&ipc_msg_buffer,
            NULL
            );

        if (status == CY_IPC_PIPE_SUCCESS) {
            break;
        }

        // If channel is busy, wait a bit and retry
        if (status == CY_IPC_PIPE_ERROR_SEND_BUSY) {
            Cy_SysLib_DelayUs(100);  // 100us delay
            retry_count++;
        } else {
            // Other error - fail immediately
            mp_printf(&mp_plat_print, "[CM33] Error: Cy_IPC_Pipe_SendMessage failed with status %d\r\n", status);
            return false;
        }
    } while (retry_count < MAX_RETRIES);

    if (status != CY_IPC_PIPE_SUCCESS) {
        mp_printf(&mp_plat_print, "[CM33] Error: Channel busy after %lu retries, status %d\r\n", retry_count, status);
        return false;
    }

    return true;
}

/*******************************************************************************
* Setup Functions
*******************************************************************************/

void cm33_ipc_pipe_isr(void) {
    Cy_IPC_Pipe_ExecuteCallback(CM33_IPC_PIPE_EP_ADDR);
}

/**
 * Initialize IPC pipe
 *
 * @param src_core Source core ID
 * @param target_core Target core ID
 * @return true if initialization successful, false otherwise
 */
static bool ipc_pipe_init(uint8_t src_core, uint8_t target_core) {
    static cy_stc_ipc_pipe_ep_t cm33_ipc_pipe_ep_array[IPC_MAX_ENDPOINTS];
    static cy_ipc_pipe_callback_ptr_t ep1_cb_array[IPC_MAX_CLIENTS_PER_EP];
    CY_SECTION_SHAREDMEM static uint32_t ipc_sema_array[CY_IPC_SEMA_COUNT / CY_IPC_SEMA_PER_WORD];

    // Allocate configuration structure
    cy_stc_ipc_pipe_config_t pipe_config;

    // Build configuration dynamically
    bool config_set = build_ipc_pipe_config(&pipe_config,
        src_core,
        target_core,
        ep1_cb_array,
        &cm33_ipc_pipe_isr);

    if (!config_set) {
        printf("Error: Failed to build IPC pipe configuration\r\n");
        return false;
    }

    // Initialize semaphores (always needed)
    Cy_IPC_Sema_Init(IPC0_SEMA_CH_NUM, CY_IPC_SEMA_COUNT, ipc_sema_array);

    // Configure endpoint array
    Cy_IPC_Pipe_Config(cm33_ipc_pipe_ep_array);

    // Initialize pipe with dynamic configuration
    Cy_IPC_Pipe_Init(&pipe_config);

    return true;
}

/********************************************************************************************************
* MicroPython Constructor:
*  IPC(src_core, target_core) - Create an IPC object to function between 2 cores.
*  Max of 5 IPC objects can be created (based on hardware capabilities) and each object can represent
*  an endpoint/channel to communicate with the target core. The src_core and target_core
*  parameters can be used to set up the endpoint based on the cores involved in communication. Currently,
*  only CM33 to CM55 communication is supported and the endpoint configuration is fixed based on this use case but in
*  the future, this can be extended to support dynamic endpoint configuration based on the cores selected during
*  object creation.
********************************************************************************************************/
static mp_obj_t machine_ipc_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    enum { ARG_src_core, ARG_target_core };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_src_core, MP_ARG_INT, {.u_int = CM33} },
        { MP_QSTR_target_core, MP_ARG_INT, {.u_int = CM55} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_ipc_obj_t *self = NULL;
    for (uint8_t i = 0; i < IPC_MAX_ENDPOINTS; i++) {
        if (MP_STATE_PORT(machine_ipc_obj[i]) == NULL) {
            self = mp_obj_malloc(machine_ipc_obj_t, &machine_ipc_type);
            MP_STATE_PORT(machine_ipc_obj[i]) = self;
            break;
        }
    }
    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("all available IPC instances are allocated"));
    }
    self->base.type = &machine_ipc_type;

    // Initialise all client slots to unregistered sentinel so duplicate-check works
    for (uint8_t i = 0; i < IPC_MAX_CLIENTS_PER_EP; i++) {
        mp_irq_init(&sender_clients_arr[i].base, &machine_ipc_client_irq_methods,
            MP_OBJ_FROM_PTR(&sender_clients_arr[i]));
        sender_clients_arr[i].base.base.type = &machine_ipc_client_type;
        sender_clients_arr[i].client_id = IPC_CLIENT_ID_UNREGISTERED;
        sender_clients_arr[i].last_cmd = 0;
        sender_clients_arr[i].last_value = 0;
        MP_STATE_PORT(machine_ipc_client_handlers)[i] = mp_const_none;
    }

