micropython/micropython/ports/psoc-edge/machine_ipc.c
    // Validate cores selected
    if (args[ARG_src_core].u_int != CM33 || args[ARG_target_core].u_int != CM55) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid core values: only CM33<->CM55 communication is supported"));
    }

    // Store core information in the object for future reference (e.g., during endpoint registration)
    self->src_core = args[ARG_src_core].u_int;
    self->target_core = args[ARG_target_core].u_int;

    // Initialize sender endpoint structure based on source and target cores. Each endpoint can have max of IPC_MAX_CLIENTS_PER_EP clients,
    self->sender_endpoint = &sender_clients_arr[0];
    self->sender_endpoint->ep_id = args[ARG_src_core].u_int;
    self->sender_endpoint->ep_addr = CM33_IPC_PIPE_EP_ADDR;

    return MP_OBJ_FROM_PTR(self);
}

/* Callback to handle messages received from CM55 in CM33-NS. Registered with
*  the IPC driver for the CM33 source endpoint; called from the IPC ISR
*  (cm33_ipc_pipe_isr) when a message arrives from CM55.
*  Extracts cmd/value from the message and stores them in the per-client object
*  identified by client_id, then defers the Python callback to the MicroPython
*  VM via mp_irq_handler / mp_sched_schedule instead of calling it directly.
*/
void cm33_msg_callback(uint32_t *msg_data) {
    if (msg_data == NULL) {
        return;
    }
    ipc_msg_t *ipc_recv_msg = (ipc_msg_t *)msg_data;
    uint8_t client_id = ipc_recv_msg->client_id;

    if (client_id >= IPC_MAX_CLIENTS_PER_EP) {
        mp_printf(&mp_plat_print, "[CM33] Invalid client_id %d in received message\r\n", client_id);
        return;
    }

    machine_ipc_client_obj_t *client = &sender_clients_arr[client_id];
    if (client->base.handler != mp_const_none) {
        client->last_cmd = ipc_recv_msg->cmd;
        client->last_value = ipc_recv_msg->value;
        mp_irq_handler(&client->base);
    }
}
/********************************************************************************************************
// IPC.register_client(client_id, callback, endpoint_id, endpoint_addr) - Register a client to receive messages from the other core. The client_id is an identifier for the client (0-7) and should be unique for each client. The callback is the Python function that will be called when a message is received for this client. The endpoint_id and endpoint_addr are used to register the callback with the IPC driver for the correct endpoint.
* @param args[0] self - IPC object
* @param args[1] client_id - Unique client identifier (0-7)
* @param args[2] callback - Python function to call when message received for this client
* @param args[3] endpoint_id - Endpoint ID to register with IPC driver (e.g., CM33_IPC_PIPE_EP_ADDR)
* @param args[4] endpoint_addr - Endpoint address to register with IPC driver (e.g., CM33_IPC_PIPE_EP_ADDR)
********************************************************************************************************/

static mp_obj_t machine_ipc_register_client(size_t n_args, const mp_obj_t *args) {
    uint8_t client_id = mp_obj_get_int(args[1]);
    mp_obj_t callback_handler = args[2];
    uint8_t endpoint_id = mp_obj_get_int(args[3]);
    uint32_t endpoint_addr = mp_obj_get_int(args[4]);


    // Validate client_id : Should be unique i.e no two clients can have same id and should be less than IPC_MAX_CLIENTS_PER_EP
    if (client_id >= IPC_MAX_CLIENTS_PER_EP) {
        mp_printf(&mp_plat_print, "Error: Invalid client_id %d (max %ld)\r\n",
            client_id, IPC_MAX_CLIENTS_PER_EP - 1);
        return mp_const_false;
    }

    // Validate callback
    if (callback_handler != mp_const_none && !mp_obj_is_callable(callback_handler)) {
        mp_printf(&mp_plat_print, "Error: Callback is not callable\r\n");
        return mp_const_false;
    }

    // Check if client_id is already registered (unregistered slots have IPC_CLIENT_ID_UNREGISTERED)
    for (uint8_t i = 0; i < IPC_MAX_CLIENTS_PER_EP; i++) {
        if (sender_clients_arr[i].client_id != IPC_CLIENT_ID_UNREGISTERED &&
            sender_clients_arr[i].client_id == client_id) {
            mp_printf(&mp_plat_print, "Error: client_id %d is already registered\r\n", client_id);
            return mp_const_false;
        }
    }

    // Set the client information in the global sender_clients_arr based on client_id
    sender_clients_arr[client_id].client_id = client_id;
    sender_clients_arr[client_id].base.handler = callback_handler;
    MP_STATE_PORT(machine_ipc_client_handlers)[client_id] = callback_handler;
    sender_clients_arr[client_id].ep_addr = endpoint_addr;
    sender_clients_arr[client_id].ep_id = endpoint_id;

    // Register the C callback with IPC pipe framework. The client_id parameter is the index in the callback array where the function pointer is saved
    cy_en_ipc_pipe_status_t status = Cy_IPC_Pipe_RegisterCallback(
        endpoint_addr,           // Endpoint address (CM33_IPC_PIPE_EP_ADDR)
        &cm33_msg_callback,       // Callback function pointer
        (uint32_t)client_id      // Client ID - index in callback array
        );
    if (status != CY_IPC_PIPE_SUCCESS) {
        mp_printf(&mp_plat_print, "Error: Cy_IPC_Pipe_RegisterCallback failed with status %d\r\n", status);
        return mp_const_false;
    }

    mp_printf(&mp_plat_print, "[CM33] -> Registered client with ID: %d successfully \r\n", client_id);

    return mp_const_true;

}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_ipc_register_client_obj, 5, 5, machine_ipc_register_client);


/*******************************************************************************
* IPC.init() - Initialize IPC communication
* @param args[0] self - IPC object
*******************************************************************************/
static mp_obj_t machine_ipc_init(mp_obj_t self_in) {
    machine_ipc_obj_t *self = MP_OBJ_TO_PTR(self_in);

    // Initialize IPC pipe with dynamic configuration based on object's cores
    bool init_ok = ipc_pipe_init(self->src_core, self->target_core);

    if (!init_ok) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("IPC pipe initialization failed"));
    }

    Cy_SysLib_Delay(CM33_APP_DELAY_MS);

    mp_printf(&mp_plat_print, "IPC initialized successfully\r\n");

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_ipc_init_obj, machine_ipc_init);

