micropython/micropython/ports/psoc-edge/machine_ipc.c
/*******************************************************************************
* IPC.enable_core(core_id) - Enable target core
* @param args[0] self - IPC object
* @param args[1] core_id - Core to enable (default: CM55)
*******************************************************************************/
// Not required as API to user? Call this from constructor or init?
static mp_obj_t machine_ipc_enable_core(size_t n_args, const mp_obj_t *args) {
    // Default to CM55 (CM55) if no argument provided
    uint8_t core_id = (n_args > 1) ? mp_obj_get_int(args[1]) : CM55;

    // Currently only CM55 (CM55) is supported
    if (core_id == CM55) {
        if (cm55_enabled) {
            mp_printf(&mp_plat_print, "CM55 already enabled\r\n");
            return mp_const_true;
        }
        Cy_SysEnableCM55(MXCM55, CM55_APP_BOOT_ADDR, CM55_BOOT_WAIT_TIME_USEC);
        cm55_enabled = true;
        Cy_SysLib_Delay(CM33_APP_DELAY_MS);

        mp_printf(&mp_plat_print, "Enabling CM55 core at boot address: 0x%08X\r\n", CM55_APP_BOOT_ADDR);

        return mp_const_true;
    } else if (core_id == CM33) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid operation: CM33 core is already active and cannot be re-enabled"));
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("unsupported core, only CM55 is supported")); // ToDo: This should be generalised
    }

    return mp_const_false;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_ipc_enable_core_obj, 1, 2, machine_ipc_enable_core);

/*******************************************************************************
* IPC.send(cmd, value, client_id) - Send message to target core
*
* @param args[0] self - IPC object
* @param args[1] cmd - Command byte
* @param args[2] value - Optional data value (default: 0)
* @param args[3] client_id - Target client ID
*******************************************************************************/
static mp_obj_t machine_ipc_send(size_t n_args, const mp_obj_t *args) {
    machine_ipc_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    // Parse arguments
    uint32_t cmd = mp_obj_get_int(args[1]);
    uint32_t value = (n_args > 2) ? mp_obj_get_int(args[2]) : 0;
    uint8_t client_id = mp_obj_get_int(args[3]);

    uint32_t src_ep_addr = self->sender_endpoint->ep_addr;
    uint32_t target_ep_addr = get_ep_addr_for_core(self->target_core);

    // Use helper function to send message
    bool success = ipc_send_message(
        src_ep_addr,     // Source endpoint (from self)
        target_ep_addr,  // Target endpoint (from self->target_core)
        client_id,       // Target client
        (uint8_t)cmd,    // Command
        value            // Value
        );

    if (!success) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("IPC send failed"));
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_ipc_send_obj, 2, 4, machine_ipc_send);

/*******************************************************************************
* IPC.is_busy() - Check if IPC is busy
* @param args[0] self - IPC object
* @param args[1] Optional core_id to check specific core's IPC status (default: target_core)
*******************************************************************************/
static mp_obj_t machine_ipc_is_busy(size_t n_args, const mp_obj_t *args) {
    machine_ipc_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    uint8_t core_id = (n_args > 1) ? mp_obj_get_int(args[1]) : self->target_core;

    uint32_t channel = get_channel_for_core(core_id);
    if (channel == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid core ID"));
    }
    bool locked = Cy_IPC_Drv_IsLockAcquired(Cy_IPC_Drv_GetIpcBaseAddress(channel));
    return mp_obj_new_bool(locked);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_ipc_is_busy_obj, 1, 2, machine_ipc_is_busy);

/*******************************************************************************
* IPC locals dictionary
*******************************************************************************/
static const mp_rom_map_elem_t machine_ipc_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_ipc_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_enable_core), MP_ROM_PTR(&machine_ipc_enable_core_obj) },
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&machine_ipc_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_is_busy), MP_ROM_PTR(&machine_ipc_is_busy_obj) },
    { MP_ROM_QSTR(MP_QSTR_register_client), MP_ROM_PTR(&machine_ipc_register_client_obj) },

    // ToDo: API encapsulation for model fns - also similar to openamp Should be a wrapper on send()?
    // { MP_ROM_QSTR(MP_QSTR_start), MP_ROM_PTR(&machine_ipc_start_obj) },
    // { MP_ROM_QSTR(MP_QSTR_stop), MP_ROM_PTR(&machine_ipc_stop_obj) },

    // Core ID constants
    { MP_ROM_QSTR(MP_QSTR_CM33), MP_ROM_INT(CM33) },
    { MP_ROM_QSTR(MP_QSTR_CM55), MP_ROM_INT(CM55) },

    // Command constants
    { MP_ROM_QSTR(MP_QSTR_CMD_START), MP_ROM_INT(IPC_CMD_START) },
    { MP_ROM_QSTR(MP_QSTR_CMD_STOP), MP_ROM_INT(IPC_CMD_STOP) },
};
static MP_DEFINE_CONST_DICT(machine_ipc_locals_dict, machine_ipc_locals_dict_table);

MP_REGISTER_ROOT_POINTER(struct _machine_ipc_obj_t *machine_ipc_obj[IPC_MAX_CLIENTS_PER_EP]);
MP_REGISTER_ROOT_POINTER(mp_obj_t machine_ipc_client_handlers[IPC_MAX_CLIENTS_PER_EP]);

void machine_ipc_deinit_all(void) {
    cm55_enabled = false;
    for (uint8_t i = 0; i < IPC_MAX_CLIENTS_PER_EP; i++) {
        sender_clients_arr[i].client_id = IPC_CLIENT_ID_UNREGISTERED;
        sender_clients_arr[i].base.handler = mp_const_none;
        MP_STATE_PORT(machine_ipc_client_handlers)[i] = mp_const_none;
    }
}

MP_DEFINE_CONST_OBJ_TYPE(
    machine_ipc_type,
    MP_QSTR_IPC,
    MP_TYPE_FLAG_NONE,
    make_new, machine_ipc_make_new,
    locals_dict, &machine_ipc_locals_dict
    );
